{
  "backend/main.mo": "Motoko canister defining types and CRUD methods for blueprints, artifacts, twin drafts, playbooks, and scenarios with map‑based storage and file‑storage mixin.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs for UI and module implementations.",
  "frontend-file-summaries.txt": "Plain-text summaries describing the purpose of each frontend React component, hook, and utility file.",
  "frontend/index.css": "Tailwind CSS base/theme definitions specifying a neutral premium color palette with light/dark variants.",
  "frontend/index.html": "Basic HTML shell loading the React application and mounting the root element.",
  "frontend/src/App.tsx": "Root React component managing active section state, theme provider, query client, and rendering AppShell with pages.",
  "frontend/src/components/blueprint/BlueprintList.tsx": "Displays saved blueprints in cards with trait previews and delete actions.",
  "frontend/src/components/blueprint/BlueprintWizard.tsx": "Multi-step founder‑trait wizard that generates a doctrine manual and saves a new blueprint.",
  "frontend/src/components/blueprint/DoctrineManualPreview.tsx": "Displays the doctrine manual text and provides buttons to export it as .txt or .md.",
  "frontend/src/components/layout/AppShell.tsx": "Wraps the main application layout with header, left navigation, and content area.",
  "frontend/src/components/layout/Header.tsx": "Renders the top header with branding and a button to load demo data.",
  "frontend/src/components/layout/LeftNav.tsx": "Provides a sidebar navigation menu for switching between major app sections.",
  "frontend/src/components/narrative/PlaybookForm.tsx": "Form for generating, exporting, and saving narrative playbooks based on user inputs.",
  "frontend/src/components/narrative/PlaybookList.tsx": "Displays saved playbooks with delete functionality and brief content previews.",
  "frontend/src/components/shared/DemoBadge.tsx": "Shows a small 'Demo' badge used to mark demo items.",
  "frontend/src/components/shared/QueryState.tsx": "Handles loading, error, empty, and success UI states for data queries.",
  "frontend/src/components/simulator/ScenarioCompare.tsx": "UI for selecting and comparing two saved scenarios side‑by‑side.",
  "frontend/src/components/simulator/ScenarioForm.tsx": "Form to configure assumptions, run a simulation, and save a scenario with results.",
  "frontend/src/components/simulator/ScenarioList.tsx": "Renders a grid of scenario cards with metadata, outcome summaries, assumption badges, and delete actions using scenario query hooks.",
  "frontend/src/components/simulator/ScenarioResults.tsx": "Displays scenario results including success probability, key drivers, and branch rationales in a set of cards.",
  "frontend/src/components/twin/ArtifactIngestionPanel.tsx": "Provides UI for adding, viewing, and deleting artifacts with form handling and react-query mutations.",
  "frontend/src/components/twin/TwinDraftWorkspace.tsx": "Offers a workspace to configure draft mode, generate deterministic responses using artifacts and blueprints, and save drafts.",
  "frontend/src/hooks/queries/queryKeys.ts": "Defines stable react-query keys for all data entities including blueprints, artifacts, playbooks, scenarios, and drafts.",
  "frontend/src/hooks/queries/useArtifacts.ts": "Implements react-query hooks to load, save, and delete artifacts via the actor API with cache invalidation.",
  "frontend/src/hooks/queries/useBlueprints.ts": "Provides querying and mutation helpers for blueprints, supporting load, save, and delete operations.",
  "frontend/src/hooks/queries/useDemoData.ts": "Exposes a mutation to seed demo data and invalidate all related queries on completion.",
  "frontend/src/hooks/queries/usePlaybooks.ts": "Manages fetching, saving, and deleting playbooks through actor-backed react-query mutations.",
  "frontend/src/hooks/queries/useScenarios.ts": "Handles scenario loading and CRUD operations with react-query and automatically refreshes cache on changes.",
  "frontend/src/hooks/queries/useTwinDrafts.ts": "Loads and persists twin drafts using react-query and actor methods with cache invalidation on updates.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor using the current identity, and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including loading, login, logout, and status handling.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/lib/exportText.ts": "Exports text or markdown content by creating a Blob and triggering a file download.",
  "frontend/src/lib/generators/doctrineManual.ts": "Generates a formatted doctrine manual string using a blueprint name and trait descriptions.",
  "frontend/src/lib/generators/playbook.ts": "Builds a narrative playbook string with positioning, controversy strategy, media angles, and long‑term narrative guidance.",
  "frontend/src/lib/generators/simulator.ts": "Runs a deterministic simulation scoring assumptions to produce a probability, top drivers, and decision branches.",
  "frontend/src/lib/generators/twinDraft.ts": "Generates draft documents (board memo, investment eval, PR fallout) using prompt inputs, artifacts, and traits.",
  "frontend/src/lib/utils.ts": "Merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/BlueprintPage.tsx": "Renders the Cognitive Blueprint page with a wizard for creating blueprints and a list view wrapped in a query state component.",
  "frontend/src/pages/NarrativePage.tsx": "Displays the Narrative Dominance module with a playbook creation form and a list of existing playbooks using query state handling.",
  "frontend/src/pages/SimulatorPage.tsx": "Provides the Strategic Decision Simulator with scenario creation, comparison mode, and a scenario list controlled by query state.",
  "frontend/src/pages/TwinPage.tsx": "Implements the AI Founder Twin interface with tabs for artifact ingestion and a drafting workspace, plus a module description card.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, container settings, animations, and adds typography and container query plugins.",
  "project_state.json": "Stores overall project state, feature list, requirements, image needs, and metadata for the MythOS Elite prototype."
}